[{
    "portfolio": "Portfolio",
    "wallet": "Wallet",
    "contacts": "Contacts",
    "settings": "Settings",
    "help": "Help",
    "address": "Address",
    "insert_address": "Insert the address",
    "amount": "Amount",
    "fee": "Fee",
    "receive": "Receive",
    "copy": "Copy",
    "send": "Send",
    "close": "Close",
    "language": "Language",
    "mode": "Mode",
    "coin_type": "Coin type",
    "edit": "Edit",
    "edit_contact": "Edit contact",
    "name": "Name",
    "insert_name": "Insert the name",
    "add_contact": "Add new contact",
    "options": "Options",
    "add": "Add",
    "search_name": "Search by name...",
    "search_address": "Search by address...",
    "description": "Description",
    "address_type": "Address type",
    "help_q1": "How can I contact you?",
    "help_a1": "Any questions or problems that you may have feel with all the confidence of sending us an email detailing your doubt, it will be a pleasure to help you at any time!",
    "help_sendEmail": "Send E-mail",
    "help_q2": "I want to know about the basic concepts of the crypto currency market",
    "help_a2_1": "There are some basic concepts that you will need to know to be able to understand what is crypto currency and how it works.",
    "help_a2_2": "Public ledgers",
    "help_a2_3": "Transactions that have been confirmed since the start of a cryptocurrency creation are stored in a public ledger. Don't worry about your identity because it will be encrypted in your transaction, and the system will take care of your information integrity using some cryptographic techniques.",
    "help_a2_4": "Transactions",
    "help_a2_5": "Transaction is the process in which you pass funds from one digital wallet to another. This transaction will be submitted to a public ledger mentioned before and waits for confirmation.",
    "help_a2_6": "Mining",
    "help_a2_7": "And the proccess in which transactions are confirmed and added to a public ledger is called Mining.",
    "help_q3": "Why should I use crypto currency?",
    "help_a3": "All types of crypto currency such as Bitcoins or Ethereum can be used to buy merchandise without compromising your security because it will be anonymous, you can also transfer funds to another of your existing wallets or pass them to your friends or family. besides, the payment method is easier and cheaper because the crypto currency is not tied to any country or subject to regulation.",
    "help_q4": "The crypto currency market is dangerous?",
    "help_a4": "The digital wallet in which you will have your crypto currency is not going to be directly tied to you as a subject, but the transaction will always be publicly available in the blockchain, and crypto currency exchanges require information about their users, but afterall your identity will be encrypted in the transaction.",
    "help_q5": "The crypto currency is attach to a specific government law?",
    "help_a5": "No, crypto currencies are not tied to any government because is used outside any banking or institution government and is exchanged over the internet.",
    "help_q6": "What is a digital wallet?",
    "help_a6": "First of all a digital wallet is where all your crypto currencies will be stored that's why it's called a wallet, you can have two types of digital wallets one is called a 'hot storage wallet' and the other one is called 'cold storage wallet' the difference between this two types of wallet is that the hot storage wallet is always having communication with the internet and the cold storage wallet is not always connected to the internet this one can be in a hard-drive stored in a safe place and will only connect when you want to make a transaction.",
    "page": "Page ",
    "of": "of ",
    "filters": "Filters",
    "transactions": "Transactions",
    "from": "From",
    "date": "Date",
    "coin": "Coin",
    "hour": "Hour",
    "state": "State",
    "year": "Year",
    "month": "Month",
    "clear": "Clear search",
    "advancedFilters": "Advanced filters",
    "selectCoin": "Select a coin",
    "type": "Type",
    "generate_address": "Generate address",
    "generate": "Generate",
    "deposit": "Deposit",
    "withdrawal": "Withdrawal",
    "other": "Other",
    "success": "Success",
    "contact_added": "Contact added succesfully",
    "yes": "Yes",
    "no": "No",
    "delete": "Delete",
    "delete_contact": "Do you really want to delete this contact?",
    "contact_edited": "Contact edited succesfully",
    "warning": "Warning",
    "edit_contact_confirm": "Do you want to edit this Contact?",
    "search_address_or_type": "Search by address or type...",
    "connect_device": "Something went wrong! Please check your device connection!",
    "next": "Next",
    "exit": "Skip tutorial",
    "addresses": "Addresses",
    "portfolio_tutorial1": "This is the <strong>sidebar</strong>, where you can scroll through the different options of the application.",
    "portfolio_tutorial2": "In <strong>Portfolio</strong> you can see your current balance for each currency.",
    "portfolio_tutorial3": "In <strong>Wallet</strong> you can make transactions such as sending or receiving coins.",
    "portfolio_tutorial4": "In <strong>Contacts</strong> you can have control of the people you want to handle in your application.",
    "portfolio_tutorial5": "In <strong>Transactions</strong> you can verify the movement of your transfers.",
    "portfolio_tutorial6": "In <strong>Settings</strong> you can control the behavior of your application, through languages or themes.",
    "portfolio_tutorial7": "If you need help, you can check the <strong> Help </strong> screen at any time.",
    "portfolio_tutorial8": "This is your graph, </br> here you can see reflected </br> the changes </br> depending on the </br> balance of your coins.",
    "portfolio_tutorial9": "This is your list of coins, inside you can see a card with your current balance and its corresponding percentage.",
    "portfolio_tutorial10": "Each card is a different currency, </br> where you can see your current funds and your percentage.",
    "wallet_tutorial1": "This is the <strong> Wallet </strong> screen. </br> Here all the currencies of your application will be saved.",
    "wallet_tutorial2": "Each image represents a specific currency, within it you can perform certain transactions.",
    "walletmodal_tutorial1": "Enter the address of the person to whom you wish to transfer.",
    "walletmodal_tutorial2": "Or if you want you can select an existing contact.",
    "walletmodal_tutorial3": "Enter the amount of coins you will send.",
    "walletmodal_tutorial4": "Select the amount of fee </br> you will pay for your transaction.",
    "walletmodal_tutorial5": "You can send the amount you selected to the address you entered.",
    "walletmodal_tutorial6": "If you want you can receive coins from someone else.",
    "walletmodalcontacts_tutorial1": "You can filter your contacts by name or by the address.",
    "walletmodalcontacts_tutorial2": "All of your contacts will be shown in this table, but keep in mind that only the contacts of the currency you selected will be displayed.",
    "walletmodalcontacts_tutorial3": "You can select the contact's address by pressing this button.",
    "walletmodaladdresses_tutorial1": "These are the addresses you have available.",
    "walletmodaladdresses_tutorial2": "You can generate a QR code only by clicking on the row of the address to which you want to receive the coins.",
    "walletmodaladdresses_tutorial3": "This is the table where the addresses you have available for the currency you selected will be displayed.",
    "walletmodaladdresses_tutorial4": "You have the option to search by address or by type of address.",
    "walletmodaladdresses_tutorial5": "If you need a new address, connect CYPHER </ br> and generate a new address.",
    "walletmodalgenerate_tutorial1": "Provide a description for the address you will generate to make it easy to identify.",
    "walletmodalgenerate_tutorial2": "Select the type of address that will be.",
    "walletmodalgenerate_tutorial3": "To finish generate the address.",
    "contacts_tutorial1": "This is the <strong> Contacts </strong> screen, </br> where you can control the people you want to keep for future transfers.",
    "contacts_tutorial2": "If you need to search your contacts, you can do it by name or address.",
    "contacts_tutorial3": "Your contacts will be presented in this table, showing their corresponding information.",
    "contacts_tutorial4": "You can edit an existing contact.",
    "contacts_tutorial5": "<div style = 'text-align: left; margin-left: 100px! important'> Or you can delete it. </br> Once the contact has been deleted, it can not be recovered. </div>",
    "contacts_tutorial6": "<div> You can add a new contact at any time. </div>",
    "addcontact_tutorial1": "First you must assign a name to your contact.",
    "addcontact_tutorial2": "Then copy the address of the currency that your contact will have.",
    "addcontact_tutorial3": "And finally, select the currency to which your contact will belong.",
    "addcontact_tutorial4": "You can add your contact for future transfers.",
    "transaction_tutorial1": "This is the <strong> Transactions </strong> screen, </br> Here the transfers that have been made will be handled.",
    "transaction_tutorial2": "In this table will be shown the records of all the transfers that have been made.",
    "transaction_tutorial3": "If you want to sort the table in ascending or descending order, you can do it by clicking on any column.",
    "transaction_tutorial4": "In case you need a specific search you can do it from the search filter.",
    "advancedfilter_tutorial1": "You will have several options to filter.",
    "advancedfilter_tutorial2": "You can select the currency with which the transfer was made.",
    "advancedfilter_tutorial3": "The year in which the transfer was made.",
    "advancedfilter_tutorial4": "The month of the transfer.",
    "advancedfilter_tutorial5": "Or in the case of needing an accurate search, you can search by the exact date.",
    "advancedfilter_tutorial6": "If you need to restart the search, just click here. </br> This will also reset the fields.",
    "settings_tutorial1": "This is the <strong> Settings </strong> screen, </br> here you can manipulate certain aspects of the application.",
    "settings_tutorial2": "You can change the language </br> depending on your preference.",
    "settings_tutorial3": "You can also modify the </br> theme of the application.",
    "settings_tutorial4": "You can restart the tutorial </br> at any time.",
    "tutorial_closed": "If you need to see the tutorial, at any time you can enable it in the settings screen.",
    "welcome_tutorial": "Welcome to CYPHER! </br> Would you like to enable the tutorial?",
    "help_tutorial1": "This is the <strong> Help </strong> screen, here you can find out how digital currencies work, among other things.",
    "help_tutorial2": "The information will be displayed here explaining how digital currencies work.",
    "help_tutorial3": "If you need help,</br> you can communicate directly with us by email.",
    "wallet_name_placeholder": "Insert your new wallet name",
    "wallet_description_placeholder": "Insert your new wallet description",
    "add_wallet": "Add wallet",
    "change_wallet": "Change wallet",
    "edit_wallet": "Edit wallet",
    "welcome_cypher": "Welcome to Cypher!",
    "select_wallet": "Please select a wallet",
    "confirm_fee_text1": "The amount you are about to send is:",
    "confirm_fee_text2": "Your total with fee will be:",
    "select_fee": "Select a fee",
    "system_settings": "System settings",
    "wallet_settings": "Wallet settings",
    "show_tutorial": "Show tutorial",
    "edit_Wallet": "Edit wallet",
    "database_change_header": "Warning",
    "database_change_message": "A change has been detected<br>Do you want to synchronize the database?",
    "transaction_completed": "Transaction completed!",
    "transaction_fail": "Fail completing the transaction!",
    "no_balance": "Not enough balance!",
    "nfc_wallet": "NFC Wallets",
    "device_wallet": "Device Wallets",
    "backup_wallet": "Backup Wallet",
    "nfc_error": "Please put a NFC card on top of Cypher.",
    "nfc_success": "Backup saved successfully.",
    "update_cypher": "Update Cypher",
    "update": "Update",
    "please_wait": "Please wait...",
    "updating": "Updating..."
},
{
    "portfolio": "Portafolio",
    "wallet": "Billetera",
    "contacts": "Contactos",
    "settings": "Ajustes",
    "help": "Ayuda",
    "address": "Dirección",
    "insert_address": "Ingrese la dirección",
    "amount": "Cantidad",
    "fee": "Comisión",
    "receive": "Recibir",
    "copy": "Copiar",
    "send": "Enviar",
    "close": "Cerrar",
    "language": "Idioma",
    "mode": "Modo",
    "coin_type": "Tipo de moneda",
    "edit": "Editar",
    "edit_contact": "Editar contacto",
    "name": "Nombre",
    "insert_name": "Ingrese el nombre",
    "add_contact": "Agregar contacto nuevo",
    "options": "Opciones",
    "add": "Agregar",
    "search_name": "Buscar por nombre...",
    "search_address": "Buscar por direccion...",
    "description": "Descripción",
    "address_type": "Tipo de dirección",
    "help_q1": "¿Como puede contactarnos?",
    "help_a1": "Cualquier duda o problema que pueda tener sientase con la confianza de enviarnos un correo electrónico detallando su duda, será un placer ayudarle en cualquier momento.",
    "help_sendEmail": "Enviar correo",
    "help_q2": "Quiero saber sobre los conceptos basicos de el mercado de la cripto moneda",
    "help_a2_1": "Hay algunos conceptos básicos que necesitará saber para poder entender qué es el mercado de la cripto moneda y cómo funciona.",
    "help_a2_2": "Libros contables públicos",
    "help_a2_3": "Las transacciones que se han confirmado desde el inicio de una creación de criptomoneda se almacenan en un libro contable público. No se preocupe por su identidad porque se cifrará en su transacción, y el sistema se encargará de la integridad de su información mediante algunas técnicas criptográficas.",
    "help_a2_4": "Actas",
    "help_a2_5": "La transacción es el proceso en el que transfiere fondos de una billetera digital a otra. Esta transacción se enviará a un libro público mencionado anteriormente y esperará la confirmación.",
    "help_a2_6": "Minería",
    "help_a2_7": "Y el proceso en el que las transacciones se confirman y añaden a un libro público se denomina Minería.",
    "help_q3": "¿Por que debo usar cripto monedas?",
    "help_a3": "Todos los tipos de moneda cifrada como Bitcoins o Ethereum se pueden usar para comprar mercancía sin comprometer su seguridad porque será anónima, también puede transferir fondos a otra de sus billeteras existentes o pasarlas a sus amigos o familiares. además, el método de pago es más fácil y más barato porque la moneda criptográfica no está vinculada a ningún país ni está sujeta a regulación.",
    "help_q4": "¿El mercado de la cripto moneda es peligroso?",
    "help_a4": "La cartera virtual en la que usted tendrá sus cripto monedas no estará directamente vinculado a usted como sujeto, pero la transacción siempre estará públicamente disponible en el blockchain, y los intercambios de cripto monedas requieren información sobre sus usuarios, pero después de todo su identidad será encriptada en la transacción.",
    "help_q5": "¿Las cripto monedas estan sujetas a algun tipo de ley gubernamental?",
    "help_a5": "No, las criptomonedas no están vinculadas a ningún gobierno porque se usan fuera de cualquier gobierno bancario o instituto y se intercambian a través de Internet.",
    "help_q6": "¿Que es una billetera digital?",
    "help_a6": "En primer lugar, una billetera digital es donde se almacenan todas sus cripto monedas, por eso se llama billetera, puede tener dos tipos de billeteras digitales, una llamada 'billetera de almacenamiento en caliente' y la otra se denomina 'billetera de almacenamiento en frío'. La diferencia entre estos dos tipos de billetera es que la billetera de almacenamiento en caliente siempre está teniendo comunicación con Internet y la billetera de almacenamiento en frío no siempre está conectada a Internet. Puede guardarse en un disco duro en un lugar seguro y solo conectarse cuando quiera hacer una transacción.",
    "page": "Página ",
    "of": "de ",
    "filters": "Filtros",
    "transactions": "Transacciones",
    "from": "De",
    "date": "Fecha",
    "coin": "Moneda",
    "hour": "Hora",
    "state": "Estado",
    "year": "Año",
    "month": "Mes",
    "clear": "Limpiar busqueda",
    "advancedFilters": "Filtros avanzados",
    "selectCoin": "Seleccione una moneda",
    "type": "Tipos",
    "generate_address": "Generar dirección",
    "generate": "Generar",
    "deposit": "Depósito",
    "withdrawal": "Retiro",
    "other": "Otro",
    "success": "Exito",
    "contact_added": "Contacto añadido exitosamente",
    "yes":"Si",
    "no": "No",
    "delete": "Eliminar",
    "delete_contact": "¿Desea eliminar este contacto?",
    "contact_edited": "Contacto editado exitosamente",
    "warning": "Advertencia",
    "edit_contact_confirm": "¿Desea editar este contacto?",
    "search_address_or_type": "Buscar por dirección o tipo...",
    "connect_device": "Algo salio mal! Porfavor revise la conexión de su dispositivo!",
    "next": "Siguiente",
    "exit": "Salir del tutorial",
    "addresses": "Direcciones",
    "portfolio_tutorial1": "Esta es la <strong>barra lateral</strong>, donde podrá desplazarse por las diferentes opciones de la aplicación.",
    "portfolio_tutorial2": "En <strong>Portafolio</strong> podrá ver su balance actual por cada moneda.",
    "portfolio_tutorial3": "En <strong>Billetera</strong> podrá realizar transacciones como enviar o recibir monedas.",
    "portfolio_tutorial4": "En <strong>Contactos</strong> podrá tener un control de las personas que quiere manejar en su aplicación.",
    "portfolio_tutorial5": "En <strong>Transacciones</strong> podrá verificar el movimiento de sus transferencias.",
    "portfolio_tutorial6": "En <strong>Ajustes</strong> usted podrá controlar el comportamiento de su aplicación, por medio de lenguajes o temas.",
    "portfolio_tutorial7": "En caso de necesitar ayuda, en cualquier momento puede consultar la pantalla de <strong>Ayuda</strong>.",
    "portfolio_tutorial8": "Este es su grafico, </br> en el podra ver reflejado </br> los cambios </br> dependiendo del </br> balance de sus monedas.",
    "portfolio_tutorial9": "Esta es su lista de monedas, dentro podra ver una tarjeta con su balance actual y su porcentaje correspondiente.",
    "portfolio_tutorial10": "Cada tarjeta es una moneda diferente, </br> en ellas podrá ver sus fondos actuales y su porcentaje.",
    "wallet_tutorial1": "Esta es la pantalla de <strong>Billetera</strong>. </br> Aqui estaran guardadas todas las monedas de su aplicación.",
    "wallet_tutorial2": "Cada imagen representa una moneda específica, dentro de ella podrás realizar ciertas transacciones.",
    "walletmodal_tutorial1": "Ingrese la dirección de la persona a quien le desea hacer la transferencia.",
    "walletmodal_tutorial2": "O si usted desea puede seleccionar un contacto existente.",
    "walletmodal_tutorial3": "Ingrese la cantidad de monedas que enviará.",
    "walletmodal_tutorial4": "Seleccione la cantidad de comisión </br> que pagara por su transacción.",
    "walletmodal_tutorial5": "Puede enviar la cantidad que seleccionó a la dirección que ingresó.",
    "walletmodal_tutorial6": "Si desea puede recibir monedas de otra persona.",
    "walletmodalcontacts_tutorial1": "Usted podra filtrar sus contactos por nombre o por la dirección de su moneda.",
    "walletmodalcontacts_tutorial2": "En esta tabla se mostraran todos sus contactos, pero tenga en cuenta que solo se mostraran los contactos de la moneda que seleccionó.",
    "walletmodalcontacts_tutorial3": "Usted podrá seleccionar la dirección del contacto con presionar este botón.",
    "walletmodaladdresses_tutorial1": "Estas son las direcciones que usted tiene disponible.",
    "walletmodaladdresses_tutorial2": "Puede generar un codigo QR solo con darle click a la fila de la dirección a la que desea recibir las monedas.",
    "walletmodaladdresses_tutorial3": "Esta es la tabla donde se mostrarán las direcciones que usted tenga disponible para la moneda que seleccionó.",
    "walletmodaladdresses_tutorial4": "Tiene la opción de buscar por dirección o por el tipo de dirección.",
    "walletmodaladdresses_tutorial5": "Si necesita una nueva dirección conecte CYPHER </br> y genere una nueva dirección.",
    "walletmodalgenerate_tutorial1": "Proporcione una descripción para la dirección que generará para que le sea fácil identificarla.",
    "walletmodalgenerate_tutorial2": "Seleccione el tipo de dirección que sera.",
    "walletmodalgenerate_tutorial3": "Para finalizar genere la dirección.",
    "contacts_tutorial1": "Esta es la pantalla de <strong> Contactos </strong>, </br> en ella podrá controlar las personas que deséa tener guardadas para futuras transferencias.",
    "contacts_tutorial2": "Si necesita realizar una búsqueda en sus contactos, puede hacerlo por nombre o dirección.",
    "contacts_tutorial3": "Sus contactos serán presentados en esta tabla, mostrando su información correspondiente.",
    "contacts_tutorial4": "Puede editar un contacto existente.",
    "contacts_tutorial5": "<div style='text-align:left; margin-left: 100px !important'>O puede eliminarlo. </br> Una vez eliminado el contacto no podra recuperarse.</div>",
    "contacts_tutorial6": "<div>Puede agregar un nuevo contacto en cualquier momento.</div>",
    "addcontact_tutorial1": "Primero deberá de asignarle un nombre a su contacto.",
    "addcontact_tutorial2": "Luego copiar la dirección de la moneda que tendrá su contacto.",
    "addcontact_tutorial3": "Y por último, seleccionar la moneda a la que pertenecerá su contacto.",
    "addcontact_tutorial4": "Puede agregar su contacto para futuras transferencias.",
    "transaction_tutorial1": "Esta es la pantalla de <strong>Transacciones</strong>, </br> Aqui se manejará un control de las transferencias que se han realizado.",
    "transaction_tutorial2": "En esta tabla se mostrarán los registros de todas las transferencias que se han realizado.",
    "transaction_tutorial3": "Si quiere ordenar la tabla de forma ascendente o descendente, lo puede hacer dando click a cualquier columna.",
    "transaction_tutorial4": "En caso de necesitar una búsqueda específica podra hacerlo desde el filtro de búsqueda.",
    "advancedfilter_tutorial1": "Usted tendrá varias opciones para filtrar.",
    "advancedfilter_tutorial2": "Podrá seleccionar la moneda con la cual se realizo la transferencia.",
    "advancedfilter_tutorial3": "El año en el que la transferencia fue efectuada.",
    "advancedfilter_tutorial4": "El mes de la transferencia.",
    "advancedfilter_tutorial5": "O en el caso de necesitar una búsqueda precisa, podra buscar por la fecha exacta.",
    "advancedfilter_tutorial6": "Sí se ve en la necesidad de reiniciar la búsqueda bastará con dar click aquí. </br> Esto reiniciará a su vez los campos.",
    "settings_tutorial1": "Esta es la pantalla de <strong>Ajustes</strong>, </br> aquí podrá manipular ciertos aspectos de la aplicación.",
    "settings_tutorial2": "Puede cambiar el idioma </br> dependiendo de su preferencia.",
    "settings_tutorial3": "También puede modificar </br> el tema de la aplicación.",
    "settings_tutorial4": "Puede reiniciar el tutorial </br> en cualquier momento",
    "tutorial_closed": "Si necesita ver el tutorial, en cualquier momento podrá habilitarlo en la pantalla de ajustes.",
    "welcome_tutorial": "¡Bienvenido a CYPHER! </br> ¿Desea habilitar el tutorial?",
    "help_tutorial1": "Esta es la pantalla de <strong>Ayuda</strong>. Aquí usted podrá informarse sobre como funcionan las monedas digitales, entre otras cosas.",
    "help_tutorial2": "La información sera desplegada aquí explicando de la forma mas detallada como funcionan las monedas digitales.",
    "help_tutorial3": "Si necesita ayuda, </br> podrá comunicarse directamente con nosotros </br> por medio de correo electrónico.",
    "wallet_name_placeholder": "Ingrese el nombre de su nueva billetera",
    "wallet_description_placeholder": "Ingrese la descripción de su nueva billetera",
    "add_wallet": "Agregar billetera",
    "change_wallet": "Cambiar billetera",
    "edit_wallet": "Editar billetera",
    "welcome_cypher": "¡Bienvenido a Cypher!",
    "select_wallet": "Seleccione una billetera",
    "confirm_fee_text1": "El monto que usted enviará es de:",
    "confirm_fee_text2": "Su total con comisión seria de:",
    "select_fee": "Seleccione una comisión",
    "system_settings": "Ajustes del sistema",
    "wallet_settings": "Ajustes de la billetera",
    "show_tutorial": "Mostrar tutorial",
    "edit_Wallet": "Editar billetera",
    "database_change_header": "Alerta",
    "database_change_message": "Se detectó un cambio en la base de datos.<br>¿Desea sincronizar la base de datos?",
    "transaction_completed": "¡Transacción completada!",
    "transaction_fail": "¡Falló al completar la transacción!",
    "no_balance": "¡Fondos insuficientes!",
    "nfc_wallet": "Billeteras NFC",
    "device_wallet": "Billeteras en el dispositivo",
    "backup_wallet": "Billetera de respaldo",
    "nfc_error": "Por favor coloque una tarjeta NFC sobre Cypher.",
    "nfc_success": "Copia de respaldo guardada exitosamente.",
    "update_cypher": "Actualizar Cypher",
    "update": "Actualizar",
    "please_wait": "Por favor espere...",
    "updating": "Actualizando..."
}]